
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 

	ЗаполнитьФормуВыбораСсылкиНаФайл();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьФормуВыбораСсылкиНаФайл()
	
	АдресФайла = "https://green-api.com/max/_next/static/media/max-big-logo.191ead69.png";
	ИмяФайла   = "GreenAPI.png"
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	ЕстьРасширениеФайла = СтрНайти(ИмяФайла,  ".", НаправлениеПоиска.СКонца) <> 0;
	Если Не ЕстьРасширениеФайла Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Имя файла должно содержать расширение";
		Сообщение.Поле = "ИмяФайла";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	ОповеститьОВыборе(Новый Структура("ИмяФормы,АдресФайла,ИмяФайла", "ВыборСсылкиНаФайл", АдресФайла, ИмяФайла));
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

