&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ЗаполнитьФормуКонтакта();
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьФормуКонтакта()
	
	Телефон  = Число("79876543210");
	Имя      = "Иван";
	Фамилия  = "Иванов";
	Компания = "Рога и Копыта";
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)  
	
	Закрыть(); 
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	ОповеститьОВыборе(Новый Структура("ИмяФормы, Телефон, Имя, Фамилия, Компания", "ВыборКонтакта",
		Телефон, Имя, Фамилия, Компания));
	
КонецПроцедуры
